In [23]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings("ignore")

In [24]:
data = pd.read_csv("../data/label_data.csv")
data.shape

(41734, 24)

In [25]:
from sklearn.preprocessing import StandardScaler

In [26]:
data.head()

,credit_amt,sex,education,marital_status,age,repay_sep,repay_aug,repay_jul,repay_jun,repay_may,...,state_jun,state_may,state_apr,paid_sep,paid_aug,paid_jul,paid_jun,paid_may,paid_apr,default
0,20000,female,university,married,24,2,2,-1,-1,-2,...,0,0,0,0,689,0,0,0,0,yes
1,120000,female,university,single,26,-1,2,0,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,yes
2,90000,female,university,single,34,0,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,no
3,50000,female,university,married,37,0,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,no
4,50000,male,university,married,57,-1,0,-1,0,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,no

In [27]:
data.repay_apr.unique()

array([-2,  2,  0, -1,  3,  6,  4,  7,  8,  5,  1], dtype=int64)

In [28]:
data.education.value_counts(), data.sex.value_counts(
), data.marital_status.value_counts(), data.default.value_counts()

(education
 university         20458
 graduate_school    15652
 high_school         5233
 others               391
 Name: count, dtype: int64,
 sex
 female    21334
 male      20400
 Name: count, dtype: int64,
 marital_status
 married    22788
 single     18571
 others       307
 0             68
 Name: count, dtype: int64,
 default
 yes    20867
 no     20867
 Name: count, dtype: int64)